# Handling Missing Data 
Pandas uses floating point value Nan to represent missing data known as sentinel value

In [3]:
import pandas as pd 
import numpy as np
data = pd.Series(['apple', 'orange', np.nan, 'toast'])

In [4]:
data

0     apple
1    orange
2       NaN
3     toast
dtype: object

In [5]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
data[0] = None

In [7]:
data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Lets filter out some data

In [8]:
from numpy import nan as NA
data = pd.Series([1, NA, 5.6, NA, 8])

In [9]:
data

0    1.0
1    NaN
2    5.6
3    NaN
4    8.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    5.6
4    8.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    5.6
4    8.0
dtype: float64

In [13]:
data = pd.DataFrame([[5., 10.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 9.5, 1.]])

In [14]:
data

     0     1    2
0  5.0  10.5  3.0
1  1.0   NaN  NaN
2  NaN   NaN  NaN
3  NaN   9.5  1.0

In [15]:
cleaned = data.dropna()

In [17]:
cleaned

     0     1    2
0  5.0  10.5  3.0

In [18]:
# all will only drop rows that are all NA
data.dropna(how='all')

     0     1    2
0  5.0  10.5  3.0
1  1.0   NaN  NaN
3  NaN   9.5  1.0

In [19]:
# add a new column of NAs 
data[4] = NA

In [20]:
data

     0     1    2   4
0  5.0  10.5  3.0 NaN
1  1.0   NaN  NaN NaN
2  NaN   NaN  NaN NaN
3  NaN   9.5  1.0 NaN

In [22]:
# Drop column if all NaN
data.dropna(axis=1, how='all')

     0     1    2
0  5.0  10.5  3.0
1  1.0   NaN  NaN
2  NaN   NaN  NaN
3  NaN   9.5  1.0

In [35]:
df = pd.DataFrame(np.random.randn(8,5))

In [36]:
df

          0         1         2         3         4
0 -0.516531  0.726764  1.641428 -0.615773 -0.791849
1 -0.134212  0.557127  1.526431 -1.346912 -0.909585
2  0.041223 -1.606915 -0.576603  1.992732  1.326146
3  0.621307  1.740983 -0.236294  0.221232  0.751864
4 -0.751760  0.976337  0.225279 -0.121701 -0.524024
5 -0.595453 -0.490885  0.208882  0.353779  1.161996
6 -0.603317  0.398809 -0.021209  0.189166  0.085551
7  0.165947 -1.775020  1.091678 -1.627814 -0.609757

In [37]:
df.iloc[:4, 1] = NA

In [38]:
df.iloc[:3,3] = NA

In [39]:
df

          0         1         2         3         4
0 -0.516531       NaN  1.641428       NaN -0.791849
1 -0.134212       NaN  1.526431       NaN -0.909585
2  0.041223       NaN -0.576603       NaN  1.326146
3  0.621307       NaN -0.236294  0.221232  0.751864
4 -0.751760  0.976337  0.225279 -0.121701 -0.524024
5 -0.595453 -0.490885  0.208882  0.353779  1.161996
6 -0.603317  0.398809 -0.021209  0.189166  0.085551
7  0.165947 -1.775020  1.091678 -1.627814 -0.609757

In [40]:
df.dropna()

          0         1         2         3         4
4 -0.751760  0.976337  0.225279 -0.121701 -0.524024
5 -0.595453 -0.490885  0.208882  0.353779  1.161996
6 -0.603317  0.398809 -0.021209  0.189166  0.085551
7  0.165947 -1.775020  1.091678 -1.627814 -0.609757

In [47]:
df

          0         1         2         3         4
0 -0.516531       NaN  1.641428       NaN -0.791849
1 -0.134212       NaN  1.526431       NaN -0.909585
2  0.041223       NaN -0.576603       NaN  1.326146
3  0.621307       NaN -0.236294  0.221232  0.751864
4 -0.751760  0.976337  0.225279 -0.121701 -0.524024
5 -0.595453 -0.490885  0.208882  0.353779  1.161996
6 -0.603317  0.398809 -0.021209  0.189166  0.085551
7  0.165947 -1.775020  1.091678 -1.627814 -0.609757

In [48]:
df.dropna(thresh=5)

          0         1         2         3         4
4 -0.751760  0.976337  0.225279 -0.121701 -0.524024
5 -0.595453 -0.490885  0.208882  0.353779  1.161996
6 -0.603317  0.398809 -0.021209  0.189166  0.085551
7  0.165947 -1.775020  1.091678 -1.627814 -0.609757

### Filling in Missing Data
Rather than filtering out missing data and losing data, we can fill in the holes

In [50]:
df

          0         1         2         3         4
0 -0.516531       NaN  1.641428       NaN -0.791849
1 -0.134212       NaN  1.526431       NaN -0.909585
2  0.041223       NaN -0.576603       NaN  1.326146
3  0.621307       NaN -0.236294  0.221232  0.751864
4 -0.751760  0.976337  0.225279 -0.121701 -0.524024
5 -0.595453 -0.490885  0.208882  0.353779  1.161996
6 -0.603317  0.398809 -0.021209  0.189166  0.085551
7  0.165947 -1.775020  1.091678 -1.627814 -0.609757

In [51]:
df.fillna(0)

          0         1         2         3         4
0 -0.516531  0.000000  1.641428  0.000000 -0.791849
1 -0.134212  0.000000  1.526431  0.000000 -0.909585
2  0.041223  0.000000 -0.576603  0.000000  1.326146
3  0.621307  0.000000 -0.236294  0.221232  0.751864
4 -0.751760  0.976337  0.225279 -0.121701 -0.524024
5 -0.595453 -0.490885  0.208882  0.353779  1.161996
6 -0.603317  0.398809 -0.021209  0.189166  0.085551
7  0.165947 -1.775020  1.091678 -1.627814 -0.609757

In [56]:
# calling with dict, we can use different fill value for each column
df.fillna({1: 0.5, 3: 0})

          0         1         2         3         4
0 -0.516531  0.500000  1.641428  0.000000 -0.791849
1 -0.134212  0.500000  1.526431  0.000000 -0.909585
2  0.041223  0.500000 -0.576603  0.000000  1.326146
3  0.621307  0.500000 -0.236294  0.221232  0.751864
4 -0.751760  0.976337  0.225279 -0.121701 -0.524024
5 -0.595453 -0.490885  0.208882  0.353779  1.161996
6 -0.603317  0.398809 -0.021209  0.189166  0.085551
7  0.165947 -1.775020  1.091678 -1.627814 -0.609757

In [57]:
_ = df.fillna(0, inplace=True)

In [59]:
df

          0         1         2         3         4
0 -0.516531  0.000000  1.641428  0.000000 -0.791849
1 -0.134212  0.000000  1.526431  0.000000 -0.909585
2  0.041223  0.000000 -0.576603  0.000000  1.326146
3  0.621307  0.000000 -0.236294  0.221232  0.751864
4 -0.751760  0.976337  0.225279 -0.121701 -0.524024
5 -0.595453 -0.490885  0.208882  0.353779  1.161996
6 -0.603317  0.398809 -0.021209  0.189166  0.085551
7  0.165947 -1.775020  1.091678 -1.627814 -0.609757

In [60]:
df = pd.DataFrame(np.random.randn(6, 3))

In [61]:
df

          0         1         2
0  0.080637  1.183767  0.129953
1  1.662354  0.739795  0.466078
2  0.164604 -0.494224 -0.745637
3  0.824021 -0.546262  1.306285
4  1.120477 -1.743490 -0.453897
5 -0.162064  1.105052  0.334037

In [62]:
df.iloc[2:, 1] = NA

In [65]:
df

          0         1         2
0  0.080637  1.183767  0.129953
1  1.662354  0.739795  0.466078
2  0.164604       NaN -0.745637
3  0.824021       NaN  1.306285
4  1.120477       NaN       NaN
5 -0.162064       NaN       NaN

In [63]:
df.iloc[4:, 2] = NA

In [64]:
df

          0         1         2
0  0.080637  1.183767  0.129953
1  1.662354  0.739795  0.466078
2  0.164604       NaN -0.745637
3  0.824021       NaN  1.306285
4  1.120477       NaN       NaN
5 -0.162064       NaN       NaN

In [67]:
df.fillna(method='ffill')

          0         1         2
0  0.080637  1.183767  0.129953
1  1.662354  0.739795  0.466078
2  0.164604  0.739795 -0.745637
3  0.824021  0.739795  1.306285
4  1.120477  0.739795  1.306285
5 -0.162064  0.739795  1.306285

In [68]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.080637  1.183767  0.129953
1  1.662354  0.739795  0.466078
2  0.164604  0.739795 -0.745637
3  0.824021  0.739795  1.306285
4  1.120477       NaN  1.306285
5 -0.162064       NaN  1.306285

In [69]:
data = pd.Series([1., NA, 4.5, NA, 9])

In [70]:
data

0    1.0
1    NaN
2    4.5
3    NaN
4    9.0
dtype: float64

In [71]:
data.fillna(data.mean())

0    1.000000
1    4.833333
2    4.500000
3    4.833333
4    9.000000
dtype: float64

### Data Transformation

In [88]:
# Removing duplicates
data = pd.DataFrame({'c1': ['one', 'two'] * 3 + ['two'],
                     'c2': [1, 1, 2, 3, 3, 4, 4]})

In [89]:
data

    c1  c2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [90]:
# determine if each row is a duplicate from previous row 
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [91]:
# get rid of extra row
data.drop_duplicates()

    c1  c2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [92]:
data['c3'] = range(7)

In [93]:
data

    c1  c2  c3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [94]:
data.drop_duplicates(['c1'])

    c1  c2  c3
0  one   1   0
1  two   1   1

In [96]:
data.drop_duplicates(['c1', 'c2'], keep='last')

    c1  c2  c3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [97]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                              'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [98]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [99]:
# add column type of animal that each food came from 
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [100]:
lowercased = data['food'].str.lower()

In [101]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [102]:
data['animal'] = lowercased.map(meat_to_animal)

In [103]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [104]:
# or even better
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [106]:
data = pd.Series([1., -777., 2., -777., -1000., 3.])

In [107]:
data

0       1.0
1    -777.0
2       2.0
3    -777.0
4   -1000.0
5       3.0
dtype: float64

In [109]:
data.replace(-777, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [110]:
# or multiple values at once
data.replace([-777, 1], np.nan)

0       NaN
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [111]:
# replace with value 
data.replace({-777: np.nan, 1: 0})

0       0.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64